{
  "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
  "id": "b31e0ddd-1637-4351-af6a-2b4c3b3baa28",
  "lastModifiedDateTime": "2020-11-27T09:47:11.0029363Z",
  "createdDateTime": "2020-11-11T12:29:28.5885329Z",
  "description": null,
  "displayName": "DEMO - Windows 10 - Bitlocker Settings - Baseline",
  "version": 2,
  "firewallBlockStatefulFTP": null,
  "firewallIdleTimeoutForSecurityAssociationInSeconds": null,
  "firewallPreSharedKeyEncodingMethod": "deviceDefault",
  "firewallIPSecExemptionsAllowNeighborDiscovery": false,
  "firewallIPSecExemptionsAllowICMP": false,
  "firewallIPSecExemptionsAllowRouterDiscovery": false,
  "firewallIPSecExemptionsAllowDHCP": false,
  "firewallCertificateRevocationListCheckMethod": "deviceDefault",
  "firewallMergeKeyingModuleSettings": null,
  "firewallPacketQueueingMethod": "deviceDefault",
  "firewallProfileDomain": null,
  "firewallProfilePublic": null,
  "firewallProfilePrivate": null,
  "defenderAttackSurfaceReductionExcludedPaths": [],
  "defenderGuardedFoldersAllowedAppPaths": [],
  "defenderAdditionalGuardedFolders": [],
  "defenderExploitProtectionXml": null,
  "defenderExploitProtectionXmlFileName": null,
  "defenderSecurityCenterBlockExploitProtectionOverride": false,
  "appLockerApplicationControl": "notConfigured",
  "smartScreenEnableInShell": false,
  "smartScreenBlockOverrideForFiles": false,
  "applicationGuardEnabled": false,
  "applicationGuardBlockFileTransfer": "notConfigured",
  "applicationGuardBlockNonEnterpriseContent": false,
  "applicationGuardAllowPersistence": false,
  "applicationGuardForceAuditing": false,
  "applicationGuardBlockClipboardSharing": "notConfigured",
  "applicationGuardAllowPrintToPDF": false,
  "applicationGuardAllowPrintToXPS": false,
  "applicationGuardAllowPrintToLocalPrinters": false,
  "applicationGuardAllowPrintToNetworkPrinters": false,
  "bitLockerDisableWarningForOtherDiskEncryption": true,
  "bitLockerEnableStorageCardEncryptionOnMobile": false,
  "bitLockerEncryptDevice": true,
  "bitLockerRemovableDrivePolicy": {
    "encryptionMethod": "aesCbc256",
    "requireEncryptionForWriteAccess": false,
    "blockCrossOrganizationWriteAccess": false
  }
}
