{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds": [
    "0"
  ],
  "id": "cd4c5d22-c317-4253-b26e-6dc96d9b1447",
  "createdDateTime": "2020-12-22T15:49:20.3851308Z",
  "description": null,
  "lastModifiedDateTime": "2020-12-22T15:49:20.3851308Z",
  "displayName": "DEMO - W10 - Device Compliance Policy - Baseline non-UEFI",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": null,
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": false,
  "secureBootEnabled": false,
  "codeIntegrityEnabled": false,
  "storageRequireEncryption": false,
  "activeFirewallRequired": false,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": false,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": false,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": false,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges": []
}
